<?php

    include '_header.php';

    # http://wiki.webmoney.ru/wiki/show/Interfeys_X1
    $res = $wmxi->X1(
        1,                                # РЅРѕРјРµСЂ СЃС‡РµС‚Р°
        ANOTHER_WMID,                     # WMID РїРѕРєСѓРїР°С‚РµР»СЏ
        PRIMARY_PURSE,                    # РєРѕС€РµР»РµРє  РґР»СЏ РѕРїР»Р°С‚С‹
        0.11,                             # СЃСѓРјРјР° СЃС‡РµС‚Р°
        'РћРїРёСЃР°РЅРёРµ С‚РѕРІР°СЂР°',                # РѕРїРёСЃР°РЅРёРµ С‚РѕРІР°СЂР° РёР»Рё СѓСЃР»СѓРіРё
        'РњРѕР№ Р°РґСЂРµСЃ - РЅРµ РґРѕРј Рё РЅРµ СѓР»РёС†Р°',  # Р°РґСЂРµСЃ РґРѕСЃС‚Р°РІРєРё С‚РѕРІР°СЂР°
        0,                                # СЃСЂРѕРє РїСЂРѕС‚РµРєС†РёРё СЃРґРµР»РєРё
        0                                 # СЃСЂРѕРє РѕРїР»Р°С‚С‹ СЃС‡РµС‚Р°
    );

    print_r($res->toObject());
