<?php

    include '_header.php';

    # http://wiki.webmoney.ru/wiki/show/Interfeys_X17
    $res = $wmxi->X17a(
        'РўРµСЃС‚РѕРІС‹Р№ РєРѕРЅС‚СЂР°РєС‚',  # РќР°Р·РІР°РЅРёРµ РєРѕРЅС‚СЂР°РєС‚Р°
        1,                    # РўРёРї РєРѕРЅС‚СЂР°РєС‚Р°
        'РўРµРєСЃС‚ РєРѕРЅС‚СЂР°РєС‚Р°',    # РўРµРєСЃС‚ РєРѕРЅС‚СЂР°РєС‚Р°
        array()               # РЎРїРёСЃРѕРє WMID РїРѕР»СЊР·РѕРІР°С‚РµР»РµР№, РєРѕС‚РѕСЂС‹Рј СЂР°Р·СЂРµС€Р°РµС‚СЃСЏ Р°РєС†РµРїС‚РѕРІС‹РІР°С‚СЊ РґР°РЅРЅС‹Р№ РєРѕРЅС‚СЂР°РєС‚
    );

    print_r($res->toObject());
