<?php

    include '_header.php';

    # http://wiki.webmoney.ru/wiki/show/Interfeys_X2
    $res = $wmxi->X2(
        1,                  # РЅРѕРјРµСЂ РїРµСЂРµРІРѕРґР°
        PRIMARY_PURSE,      # РЅРѕРјРµСЂ РєРѕС€РµР»СЊРєР° СЃ РєРѕС‚РѕСЂРѕРіРѕ РІС‹РїРѕР»РЅСЏРµС‚СЃСЏ РїРµСЂРµРІРѕРґ (РѕС‚РїСЂР°РІРёС‚РµР»СЊ)
        ANOTHER_PURSE,      # РЅРѕРјРµСЂ РєРѕС€РµР»СЊРєР°, РЅРѕ РєРѕС‚РѕСЂС‹Р№ РІС‹РїРѕР»РЅСЏРµС‚СЃСЏ РїРµСЂРµРІРѕРґ (РїРѕР»СѓС‡Р°С‚РµР»СЊ)
        0.1,                # РїРµСЂРµРІРѕРґРёРјР°СЏ СЃСѓРјРјР°
        1,                  # СЃСЂРѕРє РїСЂРѕС‚РµРєС†РёРё СЃРґРµР»РєРё РІ РґРЅСЏС…
        '123',              # РєРѕРґ РїСЂРѕС‚РµРєС†РёРё СЃРґРµР»РєРё
        'РўРµСЃС‚РѕРІС‹Р№ РїР»Р°С‚РµР¶',  # РѕРїРёСЃР°РЅРёРµ РѕРїР»Р°С‡РёРІР°РµРјРѕРіРѕ С‚РѕРІР°СЂР° РёР»Рё СѓСЃР»СѓРіРё
        0,                  # РЅРѕРјРµСЂ СЃС‡РµС‚Р° (РІ СЃРёСЃС‚РµРјРµ WebMoney), РїРѕ РєРѕС‚РѕСЂРѕРјСѓ РІС‹РїРѕР»РЅСЏРµС‚СЃСЏ РїРµСЂРµРІРѕРґ
        1                   # СѓС‡РёС‚С‹РІР°С‚СЊ СЂР°Р·СЂРµС€РµРЅРёРµ РїРѕР»СѓС‡Р°С‚РµР»СЏ
    );

    print_r($res->toObject());

    var_dump($res->ErrorCode());
    var_dump($res->ErrorText());
