<?php

    include '_header.php';

    # http://wiki.webmoney.ru/wiki/show/Interfeys_X4
    $res = $wmxi->X4(
        PRIMARY_PURSE,  # РЅРѕРјРµСЂ РєРѕС€РµР»СЊРєР°  РґР»СЏ РѕРїР»Р°С‚С‹ РЅР° РєРѕС‚РѕСЂС‹Р№ РІС‹РїРёСЃС‹РІР°Р»СЃСЏ СЃС‡РµС‚
        0,              # РЅРѕРјРµСЂ СЃС‡РµС‚Р° (РІ СЃРёСЃС‚РµРјРµ WebMoney)
        0,              # РЅРѕРјРµСЂ СЃС‡РµС‚Р°
        DATE_A,         # РјРёРЅРёРјР°Р»СЊРЅРѕРµ РІСЂРµРјСЏ Рё РґР°С‚Р° СЃРѕР·РґР°РЅРёСЏ СЃС‡РµС‚Р°
        DATE_B          # РјР°РєСЃРёРјР°Р»СЊРЅРѕРµ РІСЂРµРјСЏ Рё РґР°С‚Р° СЃРѕР·РґР°РЅРёСЏ СЃС‡РµС‚Р°
    );

    print_r($res->toObject());
